In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
date = pd.read_csv("orders.csv")
time = pd.read_csv("messages.csv")

In [5]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [6]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [7]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [8]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

# Working with Dates

In [33]:
# Converting to datetime datatype
date['date'] = pd.to_datetime(date['date'])

In [34]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   date                 1000 non-null   datetime64[ns]
 1   product_id           1000 non-null   int64
 2   city_id              1000 non-null   int64
 3   orders               1000 non-null   int64
 4   date_year            1000 non-null   int32
 5   date_months_no       1000 non-null   object
 6   date_months_no_name  1000 non-null   object
 7   date_day             1000 non-null   int32
 8   date_dow             1000 non-null   int32
 9   date_dow_name        1000 non-null   object
 10  date_is_weekend      1000 non-null   int64
 11  date_month_no        1000 non-null   int32
 12  date_month_name      1000 non-null   object
dtypes: datetime64[ns](1), int32(4), int64(4), object(4)
memory usage: 86.1+ KB

# 1. Extract year

In [35]:
date['date_year'] = date['date'].dt.year

date.sample(5)

,date,product_id,city_id,orders,date_year,date_months_no,date_months_no_name,date_day,date_dow,date_dow_name,date_is_weekend,date_month_no,date_month_name
807,2019-11-17,7367,22,1,2019,November,November,17,6,Sunday,1,11,November
488,2019-10-30,6663,4,1,2019,October,October,30,2,Wednesday,0,10,October
578,2019-06-28,5922,25,2,2019,June,June,28,4,Friday,0,6,June
27,2019-01-24,4152,28,2,2019,January,January,24,3,Thursday,0,1,January
199,2019-01-27,3817,28,4,2019,January,January,27,6,Sunday,1,1,January

# 2. Extract Months

In [36]:
date['date_month_no'] = date['date'].dt.month

date.head()

,date,product_id,city_id,orders,date_year,date_months_no,date_months_no_name,date_day,date_dow,date_dow_name,date_is_weekend,date_month_no,date_month_name
0,2019-12-10,5628,25,3,2019,December,December,10,1,Tuesday,0,12,December
1,2018-08-15,3646,14,157,2018,August,August,15,2,Wednesday,0,8,August
2,2018-10-23,1859,25,1,2018,October,October,23,1,Tuesday,0,10,October
3,2019-08-17,7292,25,1,2019,August,August,17,5,Saturday,1,8,August
4,2019-01-06,4344,25,3,2019,January,January,6,6,Sunday,1,1,January

In [37]:
date['date_month_name'] = date['date'].dt.month_name()

date.head()

,date,product_id,city_id,orders,date_year,date_months_no,date_months_no_name,date_day,date_dow,date_dow_name,date_is_weekend,date_month_no,date_month_name
0,2019-12-10,5628,25,3,2019,December,December,10,1,Tuesday,0,12,December
1,2018-08-15,3646,14,157,2018,August,August,15,2,Wednesday,0,8,August
2,2018-10-23,1859,25,1,2018,October,October,23,1,Tuesday,0,10,October
3,2019-08-17,7292,25,1,2019,August,August,17,5,Saturday,1,8,August
4,2019-01-06,4344,25,3,2019,January,January,6,6,Sunday,1,1,January

# 3. Extract Days

In [38]:
date['date_day'] = date['date'].dt.day

date.head()

,date,product_id,city_id,orders,date_year,date_months_no,date_months_no_name,date_day,date_dow,date_dow_name,date_is_weekend,date_month_no,date_month_name
0,2019-12-10,5628,25,3,2019,December,December,10,1,Tuesday,0,12,December
1,2018-08-15,3646,14,157,2018,August,August,15,2,Wednesday,0,8,August
2,2018-10-23,1859,25,1,2018,October,October,23,1,Tuesday,0,10,October
3,2019-08-17,7292,25,1,2019,August,August,17,5,Saturday,1,8,August
4,2019-01-06,4344,25,3,2019,January,January,6,6,Sunday,1,1,January

In [40]:
# day of week
date['date_dow'] = date['date'].dt.dayofweek

date.head()

,date,product_id,city_id,orders,date_year,date_months_no,date_months_no_name,date_day,date_dow,date_dow_name,date_is_weekend,date_month_no,date_month_name
0,2019-12-10,5628,25,3,2019,December,December,10,1,Tuesday,0,12,December
1,2018-08-15,3646,14,157,2018,August,August,15,2,Wednesday,0,8,August
2,2018-10-23,1859,25,1,2018,October,October,23,1,Tuesday,0,10,October
3,2019-08-17,7292,25,1,2019,August,August,17,5,Saturday,1,8,August
4,2019-01-06,4344,25,3,2019,January,January,6,6,Sunday,1,1,January

In [41]:
# day of week - name

date['date_dow_name'] = date['date'].dt.day_name()

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_months_no,date_months_no_name,date_day,date_dow,date_dow_name,date_is_weekend,date_month_no,date_month_name
0,2019-12-10,2019,December,December,10,1,Tuesday,0,12,December
1,2018-08-15,2018,August,August,15,2,Wednesday,0,8,August
2,2018-10-23,2018,October,October,23,1,Tuesday,0,10,October
3,2019-08-17,2019,August,August,17,5,Saturday,1,8,August
4,2019-01-06,2019,January,January,6,6,Sunday,1,1,January

In [42]:
# is weekend?

date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday', 'Saturday']), 1,0)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_months_no,date_months_no_name,date_day,date_dow,date_dow_name,date_is_weekend,date_month_no,date_month_name
0,2019-12-10,2019,December,December,10,1,Tuesday,0,12,December
1,2018-08-15,2018,August,August,15,2,Wednesday,0,8,August
2,2018-10-23,2018,October,October,23,1,Tuesday,0,10,October
3,2019-08-17,2019,August,August,17,5,Saturday,1,8,August
4,2019-01-06,2019,January,January,6,6,Sunday,1,1,January

# Extract week of the year

In [44]:
date['date_week'] = date['date'].dt.isocalendar().week
date.drop(columns=['product_id', 'city_id', 'orders']).head()

,date,date_year,date_months_no,date_months_no_name,date_day,date_dow,date_dow_name,date_is_weekend,date_month_no,date_month_name,date_week
0,2019-12-10,2019,December,December,10,1,Tuesday,0,12,December,50
1,2018-08-15,2018,August,August,15,2,Wednesday,0,8,August,33
2,2018-10-23,2018,October,October,23,1,Tuesday,0,10,October,43
3,2019-08-17,2019,August,August,17,5,Saturday,1,8,August,33
4,2019-01-06,2019,January,January,6,6,Sunday,1,1,January,1

# Extract Quarter

In [45]:
date['quarter'] = date['date'].dt.quarter
date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_months_no,date_months_no_name,date_day,date_dow,date_dow_name,date_is_weekend,date_month_no,date_month_name,date_week,quarter
0,2019-12-10,2019,December,December,10,1,Tuesday,0,12,December,50,4
1,2018-08-15,2018,August,August,15,2,Wednesday,0,8,August,33,3
2,2018-10-23,2018,October,October,23,1,Tuesday,0,10,October,43,4
3,2019-08-17,2019,August,August,17,5,Saturday,1,8,August,33,3
4,2019-01-06,2019,January,January,6,6,Sunday,1,1,January,1,1

# Extract Semester

In [47]:
date['semester'] = np.where(date['quarter'].isin([1,2]), 1, 2)
date.drop(columns=['product_id', 'city_id', 'orders']).head()

,date,date_year,date_months_no,date_months_no_name,date_day,date_dow,date_dow_name,date_is_weekend,date_month_no,date_month_name,date_week,quarter,semester
0,2019-12-10,2019,December,December,10,1,Tuesday,0,12,December,50,4,2
1,2018-08-15,2018,August,August,15,2,Wednesday,0,8,August,33,3,2
2,2018-10-23,2018,October,October,23,1,Tuesday,0,10,October,43,4,2
3,2019-08-17,2019,August,August,17,5,Saturday,1,8,August,33,3,2
4,2019-01-06,2019,January,January,6,6,Sunday,1,1,January,1,1,1

# Extract Time elapased Between Dates

In [49]:
import datetime

today = datetime.datetime.today()
print(today)

2025-10-24 22:22:09.142957

In [50]:
today - date['date']

0     2145 days 22:22:09.142957
1     2627 days 22:22:09.142957
2     2558 days 22:22:09.142957
3     2260 days 22:22:09.142957
4     2483 days 22:22:09.142957
                 ...
995   2573 days 22:22:09.142957
996   2514 days 22:22:09.142957
997   2362 days 22:22:09.142957
998   2427 days 22:22:09.142957
999   2201 days 22:22:09.142957
Name: date, Length: 1000, dtype: timedelta64[ns]

In [53]:
(today - date['date']).dt.days

0      2145
1      2627
2      2558
3      2260
4      2483
       ...
995    2573
996    2514
997    2362
998    2427
999    2201
Name: date, Length: 1000, dtype: int64

In [58]:
from dateutil.relativedelta import relativedelta
import datetime

today = datetime.datetime.today()

date['months_passed'] = date['date'].apply(lambda d: (today.year - d.year) * 12 + (today.month - d.month))

In [59]:
date['months_passed']

0      70
1      86
2      84
3      74
4      81
       ..
995    84
996    82
997    77
998    79
999    72
Name: months_passed, Length: 1000, dtype: int64

In [61]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [62]:
# Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])

In [63]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [64]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

# Extract Time part

In [65]:
time['time'] = time['date'].dt.time
time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

# Time difference

In [66]:
today - time['date']

0     4331 days 21:36:01.503088
1     4195 days 22:46:01.503088
2     4681 days 22:05:01.503088
3     3983 days 21:55:01.503088
4     4380 days 23:15:01.503088
                 ...
995   4970 days 21:36:01.503088
996   4291 days 23:12:01.503088
997   4756 days 22:49:01.503088
998   4872 days 22:52:01.503088
999   4144 days 23:01:01.503088
Name: date, Length: 1000, dtype: timedelta64[ns]

In [68]:
(today - time['date']) / np.timedelta64(1,'s')

0      3.742762e+08
1      3.625300e+08
2      4.045179e+08
3      3.442101e+08
4      3.785157e+08
           ...
995    4.294858e+08
996    3.708259e+08
997    4.110005e+08
998    4.210231e+08
999    3.581245e+08
Name: date, Length: 1000, dtype: float64

In [70]:
(today - time['date']) / np.timedelta64(1,'m')

0      6.237936e+06
1      6.042166e+06
2      6.741965e+06
3      5.736835e+06
4      6.308595e+06
           ...
995    7.158096e+06
996    6.180432e+06
997    6.850009e+06
998    7.017052e+06
999    5.968741e+06
Name: date, Length: 1000, dtype: float64

In [71]:
(today - time['date']) / np.timedelta64(1,'h')

0      103965.600418
1      100702.767084
2      112366.083751
3       95613.917084
4      105143.250418
           ...
995    119301.600418
996    103007.200418
997    114166.817084
998    116950.867084
999     99479.017084
Name: date, Length: 1000, dtype: float64